jirik09/Instrulab_V2/V2/Projects/STM32F303 Nucleo/Inc/tim.h
/**
  ******************************************************************************
  * File Name          : TIM.h
  * Date               : 18/01/2015 10:00:31
  * Description        : This file provides code for the configuration
  *                      of the TIM instances.
  ******************************************************************************
  *
  * COPYRIGHT(c) 2015 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __tim_H
#define __tim_H
#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f3xx_hal.h"

	 
uint8_t TIM_Reconfig(uint32_t samplingFreq,TIM_HandleTypeDef* htim_base,uint32_t* realFreq);
	 
#ifdef USE_SCOPE
uint8_t TIM_Reconfig_scope(uint32_t samplingFreq,uint32_t* realFreq);
#endif //USE_SCOPE
	 
#ifdef USE_GEN
uint8_t TIM_Reconfig_gen(uint32_t samplingFreq,uint8_t chan,uint32_t* realFreq);
#endif //USE_GEN

#ifdef USE_SCOPE
void TIMScopeEnable(void);
void TIMScopeDisable(void);
void MX_TIM3_Init(void);
uint32_t getMaxScopeSamplingFreq(uint8_t ADCRes);
#endif //USE_SCOPE

#ifdef USE_GEN
void TIMGenEnable(void);
void TIMGenDisable(void);
void MX_TIM6_Init(void);
void MX_TIM7_Init(void);
#endif //USE_GEN

#ifdef USE_PWM
void PWMEnable(void);
void PWMDisable(void);
void MX_TIM3_Init(void);
void MX_TIM15_Init(void);
#endif //USE_PWM

#ifdef USE_COUNTER
void MX_TIM4_Init(void);
void MX_TIM2_ETR_Init(void);
void MX_TIM2_IC_Init(void);
void TIM_counter_etr_init(void);
void TIM_counter_ic_init(void);
void TIM_etr_deinit(void);
void TIM_ic_deinit(void);
void COUNTER_ETR_DMA_CpltCallback(DMA_HandleTypeDef *dmah);	
void COUNTER_IC1_DMA_CpltCallback(DMA_HandleTypeDef *dmah);
//void COUNTER_IC2_DMA_CpltCallback(DMA_HandleTypeDef *dmah);
void ETRP_Config(double freq);
#endif // USE_COUNTER

	 
#ifdef __cplusplus
}
#endif
#endif /*__ tim_H */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
